/*******************************************************************
文    件:             mainwindow.cpp
功    能:             实现主窗口的类
函数列表:             
日    期:             
********************************************************************/
#include "mainwindow.h"

/*******************************************************************
函    数:        
功    能:
传入参数:
传出参数:
返    回:
*******************************************************************/
MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent)
{
}

MainWindow::~MainWindow()
{

}
