/*******************************************************************
文    件:             mainwindow.cpp
功    能:             实现主窗口的类
函数列表:             
日    期:             
********************************************************************/
#include "mainwindow.h"

/*******************************************************************
函    数:             MainWindow
功    能:             构造函数(画主界面的函数)
传入参数:              parent:传给父类的参数
传出参数:
返    回:
*******************************************************************/
MainWindow::MainWindow(QWidget *parent)
    : QMainWindow(parent)
{
    /*设置界面标题*/
    setWindowTitle(QString::fromUtf8("MyQ"));


    /*设置界面尺寸*/
    this->setMinimumSize(QSize(182,450));                    //设置界面最小尺寸
    this->setMaximumSize(QSize(182,450));                    //设置界面最大尺寸
}

/*******************************************************************
函    数:        
功    能:
传入参数:
传出参数:
返    回:
*******************************************************************/
MainWindow::~MainWindow()
{

}

/*******************************************************************
函    数:        initGroup
功    能:        初始化好友列表的函数
传入参数:        无 
传出参数:        无
返    回: 
*******************************************************************/
bool MainWindow::initGroup()
{
    
}
